#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Расставьте знаки операций "плюс", "минус", "умножение" и скобки
# между числами "1 2 3 4 5" так, что бы получилось число "25".
#
# Использовать нужно только указанные знаки операций, но не обязательно все перечесленные.
# Порядок чисел нужно сохранить.
(5*1)*4 +3 +2
# Пример для чисел "1 2 3" и "9"
result = (1 + 2) * 3
print('Результат = ', result)

result = ((5*1) * 4 + 3 + 2)
print('Результат = ', result)
# TODO написать формулу для 1 2 3 4 5 и вывести значение на консоль
